Repository: CofficLab/Lumi
Catalog: Plugins/LLMProviderStepFunPlugin/Sources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: Check StepFun StepPlan Account Settings
zh_hans: 检查 StepFun StepPlan 账户设置
zh_hk: 檢查 StepFun StepPlan 帳戶設定

# Configure your StepFun API Key below, then resend your message.
source: Configure your StepFun StepPlan API Key below, then resend your message.
zh_hans: 请在下方配置你的 StepFun StepPlan API Key，然后重新发送消息。
zh_hk: 請於下方配置你的 StepFun StepPlan API Key，然後重新發送訊息。

# Contributes StepFun models to Lumi Chat.
source: Contributes StepFun StepPlan models to Lumi Chat.
zh_hans: 为 Lumi Chat 贡献 StepFun StepPlan 模型。
zh_hk: 為 Lumi Chat 貢獻 StepFun StepPlan 模型。

# Enter StepFun API Key
source: Enter StepFun StepPlan API Key
zh_hans: 输入 StepFun StepPlan API Key
zh_hk: 輸入 StepFun StepPlan API Key

source: Failed to connect to StepFun StepPlan API. Please check your network connection and try again.
zh_hans: 无法连接到 StepFun StepPlan API。请检查网络连接后重试。
zh_hk: 無法連線到 StepFun StepPlan API。請檢查網路連線後重試。

# Get API Key on StepFun Open Platform
source: Get API Key on StepFun StepPlan Open Platform
zh_hans: 前往 StepFun StepPlan 开放平台获取 API Key
zh_hk: 前往 StepFun StepPlan 開放平台獲取 API Key

source: Hide API Key
zh_hans: 隐藏 API Key
zh_hk: 隱藏 API Key

source: Please check your API Key and try again.
zh_hans: 请检查你的 API Key 后重试。
zh_hk: 請檢查你的 API Key 後重試。

source: Show API Key
zh_hans: 显示 API Key
zh_hk: 顯示 API Key

# StepFun API access forbidden
source: StepFun StepPlan API access forbidden
zh_hans: StepFun StepPlan API 访问被拒绝
zh_hk: StepFun StepPlan API 存取被拒絕

# StepFun API error
source: StepFun StepPlan API error
zh_hans: StepFun StepPlan API 错误
zh_hk: StepFun StepPlan API 錯誤

# StepFun API Key invalid or expired
source: StepFun StepPlan API Key invalid or expired
zh_hans: StepFun StepPlan API Key 无效或已过期
zh_hk: StepFun StepPlan API Key 無效或已過期

# StepFun API Key required
source: StepFun StepPlan API Key required
zh_hans: 需要 StepFun StepPlan API Key
zh_hk: 需要 StepFun StepPlan API Key

# StepFun request failed
source: StepFun StepPlan request failed
zh_hans: StepFun StepPlan 请求失败
zh_hk: StepFun StepPlan 請求失敗

# The StepFun API returned an error. Please try again later.
source: The StepFun StepPlan API returned an error. Please try again later.
zh_hans: StepFun StepPlan API 返回错误。请稍后重试。
zh_hk: StepFun StepPlan API 返回錯誤。請稍後重試。

source: Your API Key may not have the required permissions. Please check your account settings.
zh_hans: 你的 API Key 可能没有所需的权限。请检查你的账户设置。
zh_hk: 你的 API Key 可能沒有所需的權限。請檢查你的帳戶設定。
